app/controllers/admin_controller.rb

  def index
    @new_sites = User.where(last_reviewed: nil)
    @sites_needing_review = User.where('last_reviewed != null AND updated_at > last_reviewed').order(:id)
    @sites = User.all.order(:id)
---
SELECT "users".* FROM "users" WHERE (last_reviewed != null AND last_reviewed >= updated_at) ORDER BY "users"."id" ASC
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC

  def edit
    @site = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @site = User.find(params[:id])
    if @site.update_attributes(site_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "site_url" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["site_url", "http://carlymho.com/"], ["updated_at", "2017-10-15 23:20:06.442468"], ["id", 1]]

  def approve
    @site = User.find(params[:site])
    @site.last_reviewed = DateTime.now
    @site.is_active = true
    if @site.save!
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "last_reviewed" = $1, "is_active" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["last_reviewed", "2017-10-15 17:45:31.646570"], ["is_active", "t"], ["updated_at", "2017-10-15 17:45:31.652971"], ["id", 1]]

  def set_inactive
    @site = User.find(params[:site])
    @site.last_reviewed = DateTime.now
    @site.is_active = false
    if @site.save!
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "last_reviewed" = $1, "is_active" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["last_reviewed", "2017-10-15 17:38:21.988577"], ["is_active", "f"], ["updated_at", "2017-10-15 17:38:21.992873"], ["id", 1]]