app/controllers/home_controller.rb

  def index
    @sites = User.order("RANDOM()").first(3)
---
SELECT  "users".* FROM "users" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 3]]