app/controllers/sites_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC
---
  def index
    @sites = User.all.order(:id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @site = User.find(params[:id])